<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
   <dict>
      <key>Description</key>
      <string>Downloads latest Atom zip file and builds a package. The installer package includes a preinstall script that will check for an existing Atom.app in /Applications and remove it if found. It also contains a postinstall script which configures automatic Chrome updates for all users.</string>
      <key>Identifier</key>
      <string>net.trouton.pkg.atom</string>
      <key>Input</key>
      <dict>
         <key>NAME</key>
         <string>Atom</string>
         <key>VENDOR</key>
         <string>GitHub</string>
         <key>SOFTWARETITLE</key>
         <string>Atom</string>
         <key>SIGNINGCERTIFICATE</key>
         <string>Put_Signing_Certificate_into_AutoPkg_recipe_override</string>
      </dict>
      <key>ParentRecipe</key>
      <string>io.github.hjuutilainen.download.Atom</string>
      <key>Process</key>
      <array>
         <dict>
            <key>Arguments</key>
            <dict>
               <key>predicate</key>
               <string>SIGNINGCERTIFICATE == "Put_Signing_Certificate_into_AutoPkg_recipe_override"</string>
            </dict>
            <key>Processor</key>
            <string>StopProcessingIf</string>
         </dict>
         <dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Arguments</key>
            <dict>
               <key>pkgroot</key>
               <string>%RECIPE_CACHE_DIR%/%NAME%</string>
               <key>pkgdirs</key>
               <dict>
                  <key>Applications</key>
                  <string>0775</string>
               </dict>
            </dict>
         </dict>
        <dict>
            <key>Processor</key>
            <string>Unarchiver</string>
            <key>Arguments</key>
            <dict>
                <key>archive_path</key>
                <string>%pathname%</string>
                <key>destination_path</key>
                <string>%pkgroot%/Applications</string>
                <key>purge_destination</key>
                <true/>
            </dict>
        </dict>
        <dict>
            <key>Comment</key>
            <string>Get version from the app</string>
            <key>Processor</key>
            <string>Versioner</string>
            <key>Arguments</key>
            <dict>
                <key>input_plist_path</key>
                <string>%pkgroot%/Applications/Atom.app/Contents/Info.plist</string>
                <key>plist_version_key</key>
                <string>CFBundleShortVersionString</string>
            </dict>
        </dict>
         <dict>
            <key>Processor</key>
            <string>PkgCreator</string>
            <key>Arguments</key>
            <dict>
               <key>pkg_request</key>
               <dict>
                  <key>pkgname</key>
                  <string>%VENDOR%_%SOFTWARETITLE%_%version%</string>
                  <key>version</key>
                  <string>%version%</string>
                  <key>id</key>
                  <string>corp.sap.atom.io.app.pkg</string>
                  <key>options</key>
                  <string>purge_ds_store</string>
                  <key>scripts</key>
                  <string>Scripts</string>
                  <key>chown</key>
                  <array>
                     <dict>
                        <key>path</key>
                        <string>Applications</string>
                        <key>user</key>
                        <string>root</string>
                        <key>group</key>
                        <string>admin</string>
                     </dict>
                  </array>
               </dict>
            </dict>
         </dict>
         <dict>
            <key>Processor</key>
            <string>PkgSigner</string>
            <key>Arguments</key>
            <dict>
               <key>pkg_path</key>
               <string>%RECIPE_CACHE_DIR%/%VENDOR%_%SOFTWARETITLE%_%version%.pkg</string>
               <key>signing_cert</key>
               <string>%SIGNINGCERTIFICATE%</string>
            </dict>
         </dict>
      </array>
   </dict>
</plist>